Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

По указанному адресу датасеты не доступны, скачал его с GitHub https://github.com/smanihwr/ml-latest-small

In [168]:
import pandas as pd

In [169]:
movies = pd.read_csv('movies.csv')

In [170]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [171]:
ratings = pd.read_csv('ratings.csv')

In [172]:
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [173]:
joined = ratings.merge(movies, on='movieId', how='left')
joined.head()

,userId,movieId,rating,timestamp,title,genres
0,1,1,4.0,964982703,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,1,3,4.0,964981247,Grumpier Old Men (1995),Comedy|Romance
2,1,6,4.0,964982224,Heat (1995),Action|Crime|Thriller
3,1,47,5.0,964983815,Seven (a.k.a. Se7en) (1995),Mystery|Thriller
4,1,50,5.0,964982931,"Usual Suspects, The (1995)",Crime|Mystery|Thriller

Первый способ

In [174]:
joined[joined.rating == 5]['title'].value_counts(ascending=False).index[0]

'Shawshank Redemption, The (1994)'

Второй способ

In [175]:
joined[joined.rating == 5][['title', 'rating']].groupby('title').count().sort_values(by='rating', ascending = False).index[0]

'Shawshank Redemption, The (1994)'

Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [176]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [177]:
sum(data[((data['country'] == 'Latvia') | (data['country'] == 'Estonia') | (data['country'] == 'Lithuania')) 
& (data['year'] >= 2005) & (data['year'] <= 2010) & ((data['category'] == 4) | (data['category'] == 12) 
| (data['category'] == 21)) & (data['quantity'] >= 0)]['quantity'])

240580.0

Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes

https://www.finanz.ru/valyuty/v-realnom-vremeni

In [178]:
data = pd.read_html("https://fortrader.org/quotes")[1]
data

,Название,Цена,Изменение,Изменение(%),Обновлено
0,Нефть Brent Курс нефти сегодня,59.44,-0.06,-0.10,NaN
1,Нефть WTI Цены на нефть WTI,56.96,-0.02,-0.04,NaN
2,Природный газ Цена на природный газ,2.88,0.00,0.03,NaN
3,Кофе,123.95,0.00,0.00,NaN
4,Кукуруза,548.00,-1.00,-0.18,NaN
5,Соя,430.50,-0.20,-0.05,NaN
6,Хлопок,82.74,0.00,0.00,NaN